d = {
    "cmn": {
        "a": "a",
        "ai̯": "ai̯",
        "au̯": "au̯",
        "e": "e",
        "ei̯": "ei̯",
        "i": "i",
        "j": "j",  # Glide
        "o": "o",
        "ou̯": "ou̯",
        "u": "u",
        "w": "w",  # Glide
        "y": "y",
        "ɑ": "ɑ",
        "ə": "ə",
        "ɛ": "ɛ",
        "ɤ": "ɤ",
        "ɥ": "ɥ",  # Glide
        "ɹ̩": "ɹ̩",  # R-colored vowel
        "ɻ̩": "ɻ̩",
        "ʊ": "ʊ",
        "ʲa": "ʲa",
        "ʲau̯": "ʲau̯",
        "ʲe": "ʲe",
        "ʲou̯": "ʲou̯",
        "ʲɑ": "ʲɑ",
        "ʲɛ": "ʲɛ",
        "ʲʊ": "ʲʊ",
        "ʷa": "ʷa",
        "ʷai̯": "ʷai̯",
        "ʷei̯": "ʷei̯",
        "ʷo": "ʷo",
        "ʷɑ": "ʷɑ",
        "ʷə": "ʷə",
        "ᶣe": "ᶣe",
        "ᶣɛ": "ᶣɛ",
    }
}
